# OLDShowTrussSnapping

## Description
Call this function On Drag event to enable Braceworks snapping while dragging single object

```pascal
FUNCTION OLDShowTrussSnapping : BOOLEAN;
```

```python

def vs.OLDShowTrussSnapping():
    return BOOLEAN
```

## Version
Availability: from Vectorworks 2018
## Category
* Truss Analysis